In [1]:
import pandas as pd
import numpy as np

# Intro

## Titanic Dataset

In [2]:
df = pd.read_csv("titanic.csv")

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
print(df.shape)

(891, 12)

In [5]:
df['Survived'].sum()

342

In [6]:
died = df.Survived == 0
died.sum()

549

In [7]:
cond = df.Sex == 'male'
cond.mean()

0.6475869809203143

In [8]:
#boolean values, True = 1, False = 0
cond

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: Sex, Length: 891, dtype: bool

In [9]:
df.Pclass.nunique()

3

In [10]:
df.Pclass.unique()

array([3, 1, 2])

In [11]:
df.Fare.nunique()

248

In [12]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [13]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### Subsetting
- Similar to SQL statement select * where (condition)...

In [15]:
#show last 10 rows where Pclass equals 1
df[df.Pclass == 1].tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
853,854,1,1,"Lines, Miss. Mary Conover",female,16.0,0,1,PC 17592,39.4000,D28,S
856,857,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,NaN,S
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.5500,E17,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [17]:
#get first five entries of first class passengers that are also male
df[(df.Pclass ==1) & (df.Sex == 'male')].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C

In [19]:
# get entries for those that are either first class passengers or male (can get first class and male using this,
# but will return if either condition is true)
df[(df.Pclass == 1) | (df.Sex == 'male')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [20]:
cond1 = df.Pclass > 1
cond2 = df.Sex == 'male'

df[cond1 & cond2].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S

## loc and iloc

In [22]:
#shuffle the rows
df2 = df.sample(frac =1)
df2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
609,610,1,1,"Shutes, Miss. Elizabeth W",female,40.0,0,0,PC 17582,153.4625,C125,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
307,308,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0,1,0,PC 17758,108.9000,C65,C
627,628,1,1,"Longley, Miss. Gretchen Fiske",female,21.0,0,0,13502,77.9583,D9,S
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C

In [23]:
#loc looks at the index
df2.loc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [25]:
#get the sex of the 4th index passenger
df2.loc[4, "Sex"]

'male'

In [27]:
df2.loc[[4,5], "Sex"]

4    male
5    male
Name: Sex, dtype: object

In [24]:
#iloc looks at the current index of the df 
df2.iloc[0]

PassengerId                          610
Survived                               1
Pclass                                 1
Name           Shutes, Miss. Elizabeth W
Sex                               female
Age                                 40.0
SibSp                                  0
Parch                                  0
Ticket                          PC 17582
Fare                            153.4625
Cabin                               C125
Embarked                               S
Name: 609, dtype: object

In [28]:
#have to look at the numerical index of the column rather than just calling column name
df2.iloc[[4, 5], 4]

34      male
28    female
Name: Sex, dtype: object

In [30]:
df2.loc[[34, 28], "Sex"]

34      male
28    female
Name: Sex, dtype: object

---

In [21]:
female_df = df[df.Sex == 'female']
female_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [31]:
female_df[0] #error bc there is no 0th index bc the 0th index was a male

KeyError: 0

In [32]:
female_df.loc[0]

KeyError: 0

In [33]:
female_df.loc[1]

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                         38.0
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: 1, dtype: object

In [36]:
#bc iloc is giving the row, rather than the index, provides info from 5th row due to starting at 0
female_df.iloc[4]

PassengerId                                     10
Survived                                         1
Pclass                                           2
Name           Nasser, Mrs. Nicholas (Adele Achem)
Sex                                         female
Age                                           14.0
SibSp                                            1
Parch                                            0
Ticket                                      237736
Fare                                       30.0708
Cabin                                          NaN
Embarked                                         C
Name: 9, dtype: object

In [37]:
female_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [38]:
#w/o iloc, will still behave as iloc
female_df[:4] # ":" means through n...

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S

In [40]:
female_df.iloc[:4]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S

In [39]:
female_df.loc[:4] # ":" means up to but not including n...

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [41]:
#get the survival status, name, and class of first 4 rows of passengers in df
female_df.iloc[:4][['Survived', 'Name', 'Pclass']]

   Survived                                               Name  Pclass
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2         1                             Heikkinen, Miss. Laina       3
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
8         1  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)       3

In [42]:
#get survival status and name of third class passengers
female_df.loc[female_df['Pclass'] == 3, ['Survived', 'Name', 'Pclass']]

     Survived                                               Name  Pclass
2           1                             Heikkinen, Miss. Laina       3
8           1  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)       3
10          1                    Sandstrom, Miss. Marguerite Rut       3
14          0               Vestrom, Miss. Hulda Amanda Adolfina       3
18          0  Vander Planke, Mrs. Julius (Emelia Maria Vande...       3
..        ...                                                ...     ...
863         0                  Sage, Miss. Dorothy Edith "Dolly"       3
875         1                   Najib, Miss. Adele Kiamie "Jane"       3
882         0                       Dahlberg, Miss. Gerda Ulrika       3
885         0               Rice, Mrs. William (Margaret Norton)       3
888         0           Johnston, Miss. Catherine Helen "Carrie"       3

[144 rows x 3 columns]

## Map and Apply
- More efficient to use `map` or `apply` than to use functions one by one

In [43]:
df.sort_index(inplace = True)

In [44]:
# we want to grab the last name
df.Name.values[-10:][0]

'Markun, Mr. Johann'

In [46]:
#split at the comma and not get the 0 index item (the family/first item name)
"Markun, Mr. Johann".split(",")

['Markun', ' Mr. Johann']

In [45]:
#split at the comma
"Markun, Mr. Johann".split(",")[0]

'Markun'

In [ ]:
def get_first_name(x):
    return x.split(',')[0]

In [48]:
#create a column for Last_name
df['Last_name'] = df['Name'].map(lambda x: x.split(',')[0])
df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_name
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S,van Billiard
205,206,0,3,"Strom, Miss. Telma Matilda",female,2.0,0,1,347054,10.4625,G6,S,Strom
724,725,1,1,"Chambers, Mr. Norman Campbell",male,27.0,1,0,113806,53.1000,E8,S,Chambers
599,600,1,1,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.0,1,0,PC 17485,56.9292,A20,C,Duff Gordon
779,780,1,1,"Robert, Mrs. Edward Scott (Elisabeth Walton Mc...",female,43.0,0,1,24160,211.3375,B3,S,Robert
849,850,1,1,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,NaN,1,0,17453,89.1042,C92,C,Goldenberg
775,776,0,3,"Myhrman, Mr. Pehr Fabian Oliver Malkolm",male,18.0,0,0,347078,7.7500,NaN,S,Myhrman
827,828,1,2,"Mallet, Master. Andre",male,1.0,0,2,S.C./PARIS 2079,37.0042,NaN,C,Mallet
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,Palsson
134,135,0,2,"Sobey, Mr. Samuel James Hayden",male,25.0,0,0,C.A. 29178,13.0000,NaN,S,Sobey

In [50]:
#want to combine name and age in a single sentence

df.apply(lambda x: x['Name'] + " "  + str(x['Age']), axis = 1) #apply goes through columns, axis = 1 row-wise function

0                           Braund, Mr. Owen Harris 22.0
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                            Heikkinen, Miss. Laina 26.0
3      Futrelle, Mrs. Jacques Heath (Lily May Peel) 35.0
4                          Allen, Mr. William Henry 35.0
                             ...
886                           Montvila, Rev. Juozas 27.0
887                    Graham, Miss. Margaret Edith 19.0
888         Johnston, Miss. Catherine Helen "Carrie" nan
889                           Behr, Mr. Karl Howell 26.0
890                             Dooley, Mr. Patrick 32.0
Length: 891, dtype: object

In [51]:
#get the log of each fare
#import numpy as np
df['log_fare'] = df.Fare.map(lambda x:np.log(x + 1)) #must add plus one because there were free tickets that cost 0 monies
df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_name,log_fare
136,137,1,1,"Newsom, Miss. Helen Monypeny",female,19.0,0,2,11752,26.2833,D47,S,Newsom,3.306275
447,448,1,1,"Seward, Mr. Frederic Kimber",male,34.0,0,0,113794,26.5500,NaN,S,Seward,3.316003
877,878,0,3,"Petroff, Mr. Nedelio",male,19.0,0,0,349212,7.8958,NaN,S,Petroff,2.185579
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,Rice,3.405355
407,408,1,2,"Richards, Master. William Rowe",male,3.0,1,1,29106,18.7500,NaN,S,Richards,2.983153
124,125,0,1,"White, Mr. Percival Wayland",male,54.0,0,1,35281,77.2875,D26,S,White,4.360388
190,191,1,2,"Pinsky, Mrs. (Rosa)",female,32.0,0,0,234604,13.0000,NaN,S,Pinsky,2.639057
827,828,1,2,"Mallet, Master. Andre",male,1.0,0,2,S.C./PARIS 2079,37.0042,NaN,C,Mallet,3.637697
115,116,0,3,"Pekoniemi, Mr. Edvard",male,21.0,0,0,STON/O 2. 3101294,7.9250,NaN,S,Pekoniemi,2.188856
538,539,0,3,"Risien, Mr. Samuel Beard",male,NaN,0,0,364498,14.5000,NaN,S,Risien,2.740840

In [52]:
def log_fn(x):
    return np.log(x + 1)

df['log_fare2'] = df.Fare.map(log_fn)

In [53]:
df.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last_name,log_fare,log_fare2
824,825,0,3,"Panula, Master. Urho Abraham",male,2.0,4,1,3101295,39.6875,NaN,S,Panula,3.705921,3.705921
514,515,0,3,"Coleff, Mr. Satio",male,24.0,0,0,349209,7.4958,NaN,S,Coleff,2.139572,2.139572
766,767,0,1,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C,Brewe,3.703768,3.703768
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,Andrews,4.368920,4.368920
709,710,1,3,"Moubarek, Master. Halim Gonios (""William George"")",male,NaN,1,1,2661,15.2458,NaN,C,Moubarek,2.787834,2.787834
98,99,1,2,"Doling, Mrs. John T (Ada Julia Bone)",female,34.0,0,1,231919,23.0000,NaN,S,Doling,3.178054,3.178054
472,473,1,2,"West, Mrs. Edwy Arthur (Ada Mary Worth)",female,33.0,1,2,C.A. 34651,27.7500,NaN,S,West,3.358638,3.358638
489,490,1,3,"Coutts, Master. Eden Leslie ""Neville""",male,9.0,1,1,C.A. 37671,15.9000,NaN,S,Coutts,2.827314,2.827314
727,728,1,3,"Mannion, Miss. Margareth",female,NaN,0,0,36866,7.7375,NaN,Q,Mannion,2.167624,2.167624
641,642,1,1,"Sagesser, Mlle. Emma",female,24.0,0,0,PC 17477,69.3000,B35,C,Sagesser,4.252772,4.252772

# Groupby

In [55]:
#(what you want to group by)[what you want to aggregate].aggregation()
df.groupby("Pclass")['log_fare'].mean()

Pclass
1    4.097748
2    2.886742
3    2.491012
Name: log_fare, dtype: float64

#### How many nulls are there in Age?

In [56]:
df['Age'].isnull().sum()

177

In [57]:
#how to use apply to get the number of nulls per class
df.groupby("Pclass")['Age'].apply(lambda x:x.isnull().sum())

Pclass
1     30
2     11
3    136
Name: Age, dtype: int64

In [59]:
#pass in a dictionary to use .agg, and then use a list of desired aggregation functiobs
df.groupby('Pclass').agg({'Age': [sum, min, max, np.mean]})

            Age
            sum   min   max       mean
Pclass
1       7111.42  0.92  80.0  38.233441
2       5168.83  0.67  70.0  29.877630
3       8924.92  0.42  74.0  25.140620

In [60]:
#can use pbd to debug
for name, grp in df.groupby('Pclass'):
    import pdb; pdb.set_trace() #type in name, and then grp when the prompt window comes up, then write 'exit' to exit

> /var/folders/2k/xc29_ql926g_35kwhcqh7j080000gp/T/ipykernel_18818/1479318797.py(1)<module>()
----> 1 for name, grp in df.groupby('Pclass'):
      2     import pdb; pdb.set_trace()

ipdb> name
1
ipdb> group
*** NameError: name 'group' is not defined
ipdb> grp
     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
6              7         0       1
11            12         1       1
23            24         1       1
..           ...       ...     ...
871          872         1       1
872          873         0       1
879          880         1       1
887          888         1       1
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
11                            Bonnell, Miss. Elizabeth  female  58.0      0
23                        Sloper, Mr. William Thompson    male  28.0      0
..                                                 ...     ...   ...    ...
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
872                           Carlsson, Mr. Frans Olof    male  33.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch    Ticket     Fare        Cabin Embarked Last_name  log_fare  \
1        0  PC 17599  71.2833          C85        C   Cumings  4.280593
3        0    113803  53.1000         C123        S  Futrelle  3.990834
6        0     17463  51.8625          E46        S  McCarthy  3.967694
11       0    113783  26.5500         C103        S   Bonnell  3.316003
23       0    113788  35.5000           A6        S    Sloper  3.597312
..     ...       ...      ...          ...      ...       ...       ...
871      1     11751  52.5542          D35        S  Beckwith  3.980694
872      0       695   5.0000  B51 B53 B55        S  Carlsson  1.791759
879      1     11767  83.1583          C50        C    Potter  4.432700
887      0    112053  30.0000          B42        S    Graham  3.433987
889      0    111369  30.0000         C148        C      Behr  3.433987

     log_fare2
1     4.280593
3     3.990834
6     3.967694
11    3.316003
23    3.597312
..         ...
871   3.980694
872   1.791759
879   4.432700
887   3.433987
889   3.433987

[216 rows x 15 columns]
ipdb> exit